**Серии в Pandas**

In [1]:
import numpy as np
import pandas as pd

In [5]:
# help(pd.Series)

In [7]:
my_index = ["USA", "Canada", "Mexico"]
my_data = [1776, 1867, 1821]

In [11]:
my_ser = pd.Series(data = my_data, index=my_index)

In [12]:
my_ser

USA       1776
Canada    1867
Mexico    1821
dtype: int64

In [14]:
my_ser.iloc[0]

np.int64(1776)

In [15]:
my_ser["USA"]

np.int64(1776)

In [16]:
ages = {"Sam": 5, "Frank": 10, "Spike": 7}

In [17]:
pd.Series(ages)

Sam       5
Frank    10
Spike     7
dtype: int64

In [18]:
# Вымышленные данные о продажах за 1й и 2й квартал для некоторой глобальной компании в разных странах
q1 = {'Japan': 80, 'China': 450, 'India': 200, 'USA': 250}
q2 = {'Brazil': 100,'China': 500, 'India': 210,'USA': 260}

In [20]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [21]:
sales_q1

Japan     80
China    450
India    200
USA      250
dtype: int64

In [22]:
sales_q2

Brazil    100
China     500
India     210
USA       260
dtype: int64

In [25]:
sales_q1["Japan"]

np.int64(80)

In [26]:
sales_q1.keys()

Index(['Japan', 'China', 'India', 'USA'], dtype='object')

In [27]:
sales_q1 + sales_q2

Brazil      NaN
China     950.0
India     410.0
Japan       NaN
USA       510.0
dtype: float64

In [30]:
first_half = sales_q1.add(sales_q2, fill_value=0)

In [32]:
pd.Series(data=first_half, dtype=np.int64)

Brazil    100
China     950
India     410
Japan      80
USA       510
dtype: int64